 이 칸을 셀(cell)이라고 합니다.

In [5]:
import pandas as pd

## 데이터 구조와 타입

In [1]:
odds = [1,3,5]

odds

[1, 3, 5]

In [2]:
type(odds)

list

In [6]:
#판다스에는 Series(한줄), dataframe(두 줄 이상)
pd_odds = pd.Series(odds)

pd_odds

0    1
1    3
2    5
dtype: int64

In [7]:
type(pd_odds)

pandas.core.series.Series

In [8]:
pd_odds.mean()

3.0

In [9]:
numbers = [[1,2,3],[4,5,6],[7,8,9]]

numbers

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [11]:
pd_numbers = pd.DataFrame(numbers)

pd_numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
type(pd_numbers)

pandas.core.frame.DataFrame

In [14]:
data = [
    ["2020-05-22", 300, 'confirmed'],
    ["2020-05-23", 500, 'confirmed'],
    ["2020-05-24", 700, 'cancelled']
]

data

[['2020-05-22', 300, 'confirmed'],
 ['2020-05-23', 500, 'confirmed'],
 ['2020-05-24', 700, 'cancelled']]

In [18]:
cols = ['date','price','result']
idx = [3,5,7]

pd_data = pd.DataFrame(data, columns=cols, index=idx)

pd_data

         date  price     result
3  2020-05-22    300  confirmed
5  2020-05-23    500  confirmed
7  2020-05-24    700  cancelled

## 데이터 불러오기

In [22]:
url = 'http://bit.ly/dsa-transaction'

data = pd.read_csv("transaction.csv", index_col='Name')

print(data.shape) 
# jupyter는 마지막만 띄우니까 중간중간에 print를 해줘야됨 
data.head()

(8, 3)

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled

In [23]:
data.tail()

            date  price      state
Name
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [25]:
data.tail(7).head(2)

            date  price      state
Name
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed

In [26]:
data.index

Index(['Kang', 'Kim', 'Choi', 'Park', 'Lee', 'Yoon', 'Jang', 'Ko'], dtype='object', name='Name')

In [27]:
data.columns

Index(['date', 'price', 'state'], dtype='object')

In [28]:
data.columns = ['date','amount','result']

data

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [29]:
data.values

array([['2017-01-01', 500, 'confirmed'],
       ['2017-01-03', 700, 'confirmed'],
       ['2017-01-03', 900, 'confirmed'],
       ['2017-01-05', 800, 'confirmed'],
       ['2017-01-07', 500, 'canceled'],
       ['2017-01-09', 700, 'confirmed'],
       ['2017-01-09', 600, 'canceled'],
       ['2017-01-10', 200, 'canceled']], dtype=object)

## 검색하기 

열(columns) 검색

In [30]:
data['date']

Name
Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-03
Park    2017-01-05
Lee     2017-01-07
Yoon    2017-01-09
Jang    2017-01-09
Ko      2017-01-10
Name: date, dtype: object

In [33]:
data[['date','result']]
cols = ['date','result']

data[cols]

            date     result
Name
Kang  2017-01-01  confirmed
Kim   2017-01-03  confirmed
Choi  2017-01-03  confirmed
Park  2017-01-05  confirmed
Lee   2017-01-07   canceled
Yoon  2017-01-09  confirmed
Jang  2017-01-09   canceled
Ko    2017-01-10   canceled

### 행(rows) 검색

In [35]:
# loc = locate 
data.loc['Kang']

date      2017-01-01
amount           500
result     confirmed
Name: Kang, dtype: object

In [37]:
idx = ['Kang','Kim']

data.loc[idx]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed

## 행열 동시검색

In [38]:
data.loc["Kang",'result']

'confirmed'

In [45]:
idx = ['Kang','Kim']
cols = ['date','result']

data.loc[idx,cols]

            date     result
Name
Kang  2017-01-01  confirmed
Kim   2017-01-03  confirmed

## 기본기능

In [39]:
 data['amount'].min()

200

In [40]:
data['amount'].sum()

4900

In [41]:
data['amount'].cumsum()

Name
Kang     500
Kim     1200
Choi    2100
Park    2900
Lee     3400
Yoon    4100
Jang    4700
Ko      4900
Name: amount, dtype: int64

In [42]:
data['amount'].std()

216.71244937540095

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, Kang to Ko
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    8 non-null      object
 1   amount  8 non-null      int64
 2   result  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 576.0+ bytes

In [49]:
data.describe()

           amount
count    8.000000
mean   612.500000
std    216.712449
min    200.000000
25%    500.000000
50%    650.000000
75%    725.000000
max    900.000000

In [47]:
data['result'].unique()

array(['confirmed', 'canceled'], dtype=object)

In [50]:
data['result'].nunique()

2

In [52]:
data['result'].value_counts(normalize=True)

confirmed    0.625
canceled     0.375
Name: result, dtype: float64

In [53]:
data.shape[0]

8

In [54]:
len(data)

8

In [56]:
data['result'].replace('canceled','cancelled')

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [58]:
data['result'].str.replace('c','d')

Name
Kang    donfirmed
Kim     donfirmed
Choi    donfirmed
Park    donfirmed
Lee      dandeled
Yoon    donfirmed
Jang     dandeled
Ko       dandeled
Name: result, dtype: object

In [59]:
data['result'].str[0]

Name
Kang    c
Kim     c
Choi    c
Park    c
Lee     c
Yoon    c
Jang    c
Ko      c
Name: result, dtype: object

In [60]:
pd.to_datetime(data['date'])

Name
Kang   2017-01-01
Kim    2017-01-03
Choi   2017-01-03
Park   2017-01-05
Lee    2017-01-07
Yoon   2017-01-09
Jang   2017-01-09
Ko     2017-01-10
Name: date, dtype: datetime64[ns]

In [63]:
pd.to_datetime(data['date']).dt.day

Name
Kang     1
Kim      3
Choi     3
Park     5
Lee      7
Yoon     9
Jang     9
Ko      10
Name: date, dtype: int64

## 색인(indexing)

In [65]:
data[data['amount'] > 500]

            date  amount     result
Name
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled

In [70]:
data[data['result'] == 'confirmed']

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Yoon  2017-01-09     700  confirmed

In [66]:
data[data['amount'] > 400]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled

In [66]:
data[data['amount'] > 400]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled

In [78]:
# data[(data['amount'] > 500) | (data['result'] =='confirmed')]
amount_over_500 = (data['amount'] > 500)
confirmed = (data['result'] =='confirmed')

cols=['date','amount']
data.loc[confirmed&amount_over_500, cols]
# 행렬동시검색시 무조건 loc

            date  amount
Name
Kim   2017-01-03     700
Choi  2017-01-03     900
Park  2017-01-05     800
Yoon  2017-01-09     700

## 행열 추가/수정

In [ ]:
열 추가/수정

In [79]:
data['card-holder'] = 'DS Card'

data

            date  amount     result card-holder
Name
Kang  2017-01-01     500  confirmed     DS Card
Kim   2017-01-03     700  confirmed     DS Card
Choi  2017-01-03     900  confirmed     DS Card
Park  2017-01-05     800  confirmed     DS Card
Lee   2017-01-07     500   canceled     DS Card
Yoon  2017-01-09     700  confirmed     DS Card
Jang  2017-01-09     600   canceled     DS Card
Ko    2017-01-10     200   canceled     DS Card

In [80]:
data['order']= [1,2,3,4,5,6,7,8]

data

            date  amount     result card-holder  order
Name
Kang  2017-01-01     500  confirmed     DS Card      1
Kim   2017-01-03     700  confirmed     DS Card      2
Choi  2017-01-03     900  confirmed     DS Card      3
Park  2017-01-05     800  confirmed     DS Card      4
Lee   2017-01-07     500   canceled     DS Card      5
Yoon  2017-01-09     700  confirmed     DS Card      6
Jang  2017-01-09     600   canceled     DS Card      7
Ko    2017-01-10     200   canceled     DS Card      8

In [83]:
data['VIP']=data['amount'] > 500
cols = ['amount','VIP']
data[cols]

      amount    VIP
Name
Kang     500  False
Kim      700   True
Choi     900   True
Park     800   True
Lee      500  False
Yoon     700   True
Jang     600   True
Ko       200  False

In [90]:
amount_over_500 = data['amount'] > 500

data.loc[amount_over_500, 'level'] = 'VIP'
data.loc[~amount_over_500, 'level'] = 'non-VIP'

cols = ['amount','level']
data[cols].head()

      amount    level
Name
Kang     500  non-VIP
Kim      700      VIP
Choi     900      VIP
Park     800      VIP
Lee      500  non-VIP

행 추가/수정

In [93]:
data.loc['Han'] = [1,2,3,4,5,6,7]
data.tail(2)

            date  amount    result card-holder  order  VIP    level
Name
Ko    2017-01-10     200  canceled     DS Card      8    0  non-VIP
Han            1       2         3           4      5    6        7

## 행열 삭제

In [97]:
data.drop(columns=['amount','result'], index=["Kang","Kim"])

            date card-holder  order  VIP    level
Name
Choi  2017-01-03     DS Card      3    1      VIP
Park  2017-01-05     DS Card      4    1      VIP
Lee   2017-01-07     DS Card      5    0  non-VIP
Yoon  2017-01-09     DS Card      6    1      VIP
Jang  2017-01-09     DS Card      7    1      VIP
Ko    2017-01-10     DS Card      8    0  non-VIP
Han            1           4      5    6        7

## Apply

In [99]:
def add(a,b):
    return a + b

In [100]:
add(1,2)

3

In [101]:
def is_vip(amount):
    return amount > 500

In [104]:
data['amount'].apply(is_vip)

Name
Kang    False
Kim      True
Choi     True
Park     True
Lee     False
Yoon     True
Jang     True
Ko      False
Han     False
Name: amount, dtype: bool

In [105]:
is_vip(data['amount'])

Name
Kang    False
Kim      True
Choi     True
Park     True
Lee     False
Yoon     True
Jang     True
Ko      False
Han     False
Name: amount, dtype: bool

In [106]:
def is_vip(row):
    return row['amount'] > 500

In [108]:
data.apply(is_vip, axis=1)

Name
Kang    False
Kim      True
Choi     True
Park     True
Lee     False
Yoon     True
Jang     True
Ko      False
Han     False
dtype: bool

## 크몽

In [110]:
pd.options.display.max_columns = 100
raw_log = pd.read_csv("data/kmong-conversion.csv")
print(raw_log.shape)
raw_log.head(6)

(434244, 19)

,eventcategory,isfirstactivity,apppackagename,appversion,devicetype,devicemanufacturer,osversion,canonicaldeviceuuid,sourcetype,channel,params_campaign,params_medium,params_term,inappeventcategory,inappeventlabel,eventdatetime,rowuuid,isfirstgoalactivity,event_rank
0,goal,False,com.kmong.iOS,4.0.4,iPhone,Apple,iOS11.4.1,F36FAA62-ADAC-4AA5-9B00-1FD6CB7EE957,unattributed,unattributed,NaN,NaN,NaN,home.view,NaN,2018-09-28T00:00:00+09:00,fd2a188c-bc9b-4702-9c47-b546b2614817,False,True
1,goal,False,com.kmong.kmong,3.3.5,SM-N935S,samsung,Android7.0,8a871e50-0717-4aed-9bad-04ac3c3793be,unattributed,unattributed,NaN,NaN,NaN,gig_detail.view,41201.0,2018-09-28T00:00:00+09:00,e62dccef-dd70-4415-8a33-c8324ddaed38,False,True
2,goal,False,com.kmong.iOS,4.0.4,iPhone,Apple,iOS12.0,A9E5778A-8F3D-4597-9718-74BF953A9F64,unattributed,unattributed,NaN,NaN,NaN,inbox_detail.view,NaN,2018-09-28T00:00:00+09:00,14eb3197-db83-493a-b7be-83582960c40b,False,True
3,foreground,NaN,com.kmong.iOS,4.0.4,iPhone,Apple,iOS11.4.1,168761CB-CB67-4592-867D-52780D651297,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018-09-28T00:00:01+09:00,f9bb91af-248b-44dc-9f5c-1c00b37ea97b,NaN,True
4,goal,False,com.kmong.iOS,4.0.4,iPhone,Apple,iOS11.4.1,ACABB7C0-4C76-413A-B314-E5D6DA0D0E5D,viral,WEB,NaN,NaN,NaN,buyer_order_track.view,NaN,2018-09-28T00:00:02+09:00,236e9946-7801-4898-b609-06c8ab1139dc,False,True
5,goal,False,com.kmong.kmong,3.3.5,SM-G955N,samsung,Android8.0.0,6d1ea29b-5d5d-4c33-b2cf-7c68b41ce638,unattributed,unattributed,NaN,NaN,NaN,home.view,NaN,2018-09-28T00:00:02+09:00,db8ce65f-3707-4c1b-8361-51bcb9d4ecd9,False,True